import Image from "next/image";
import Wrapper from "@/components/Wrapper";
import Hero from "@/images/quality/hero.png";

const ITEMS = [
  {
    title: "Заборона використання хімічних пестицидів та гербіцидів",
    text: "Одним із основних принципів органічного вирощування є відмова від використання шкідливих хімічних речовин. Вирощувачі органічних продуктів повинні використовувати природні альтернативи для боротьби зі шкідниками та бур'янами. Це може включати в себе використання екологічно безпечних методів, таких як використання вегетаційних покривів та використання природних хімічних сполук.",
  },
  {
    title: "Дотримання вимог щодо добрив",
    text: "У вирощуванні органічних продуктів важливо використовувати органічні добрива, які не містять синтетичних речовин. Це допомагає підтримувати родючість ґрунту та зберігати його природний баланс.",
  },
  {
    title: "Прозорість у виробництві",
    text: "Система органічного виробництва передбачає прозорість у всіх аспектах процесу, від вирощування до збуту продукції. Виробники повинні відповідати стандартам органічного сертифікування та забезпечувати інформацію про умови вирощування та обробки.",
  },
  {
    title: "Дотримання екологічних стандартів у вирощуванні",
    text: "Органічне вирощування сприяє збереженню біорізноманіття та підтримці екосистем. Виробники органічних продуктів повинні дотримуватися екологічних стандартів, які сприяють збереженню природних ресурсів та уникненню забруднення довкілля.",
  },
  {
    title: "Відсутність ГМО",
    text: "Органічні продукти не повинні містити генетично модифікованих організмів (ГМО). Це означає, що виробники повинні використовувати лише натуральні, не модифіковані сорти рослин.",
  },
];

const QualityItem = () => {
  return (
    <section className={`w-full h-fit relative overflow-hidden`}>
      <Wrapper styles={"w-full h-fit pt-[162px] pb-[80px] flex flex-col gap-y-[70px]"}>
        <Image
          src={Hero}
          width={1400}
          height={742}
          alt="зображення зелених насаджен та чоловіка, що працює із зеленими насадженнями"
          className="mx-auto"
        />
        <div className="w-[936px] mx-auto flex flex-col">
          <h2 className="text-[50px] font-extrabold mb-8">
            Стандарти якості у вирощуванні органічних продуктів: Забезпечення чистоти в садах та на
            фермах
          </h2>
          <p className="text-grey text-lg mb-[50px]">
            Вирощування органічних продуктів - це не лише питання смаку, але й підтримки здоров'я та
            довкілля. У світі, де свідомість щодо важливості харчування зростає, стандарти якості
            вирощування органічної їжі набувають все більшого значення. Давайте розглянемо деякі з
            них, особливо в контексті вирощування фруктів, овочів, спецій, зелені, круп та горіхів.
          </p>
        </div>

        <ul className="w-[936px] mx-auto flex flex-col gap-y-10">
          {ITEMS.map((el, index) => (
            <li
              key={el.title}
              className={`w-full h-fit flex gap-x-5 items-center justify-center ${
                index % 2 === 1 ? "flex-row-reverse" : ""
              }`}
            >
              <p className="w-[25%] text-8xl h-full rounded-2xl bg-main text-white text-center py-10">
                0{index + 1}
              </p>
              <div className="w-[75%] h-full rounded-[20px] bg-lite_pink py-[63px] px-[45px] flex flex-col ">
                <h4 className="text-[25px] font-medium">{el.title}</h4>
                <p className="text-lg text-grey">{el.text}</p>
              </div>
            </li>
          ))}
        </ul>

        <div className="w-[936px] mx-auto flex flex-col">
          <h2 className="text-[50px] font-extrabold mb-8">Підсумовуючи</h2>
          <p className="text-grey text-lg mb-[60px]">
            Стандарти якості у вирощуванні органічних продуктів є основою для забезпечення якості,
            безпеки та стабільності у цій галузі. Дотримання цих стандартів дозволяє споживачам бути
            впевненими у якості та користі органічних продуктів, а також сприяє збереженню
            навколишнього середовища та підтримці здоров'я.
          </p>
        </div>
      </Wrapper>
    </section>
  );
};

export default QualityItem;
